
int main(){
// linked list เป็นโครงสร้างข้อมูลที่เรียงต่อกันเป็นสาย
// structure เป็นการกำหนดโครงสร้างข้อมูลที่มีข้อมูล หลายๆตัวอยู่ด้วยกันซึ่งอาจจะเป็นคนละประเภท
    /*struct student {      
    char id[12];
    char name[40];
    int age;
    }; 
    
    struct student std. *pstd;
    
    student เป็นชื่อ structure, id name age เป็นสมาชิกของโครงสร้าง student โดยสามารถกำหนดชื่อตัวแปรอื่นๆ(std)เพื่อให้มี โครงสร้างข้อมูลเหมือน โครงสร้าง student อีกด้วย
    เข้าถึงข้อมูลได้โดย ใช้ (.) เช่น std.age=20; 
    กรณีใช้ pointer สามารถใช้ -> แทน * กับ . ได้ เช่น *pstd.name=20; เป็น pstd->name=20;   */


// typedef เป็นการกำหนดประเภทข้อมูลขึ้นใหม่ เช่น
        /*typedef struct {
    char id[12];
    char name[40];
    int age;
    } Student;  */
    
    //เวลาประกาศตัวแปรใหม่ใช้ student std,*ptsd; ได้เลย ไม่ต้องมี struct เพราะ typedef กำหนดให้ student แทนข้อมูลประเภท struct student แล้ว
    
// จะมีการสร้างฟิลดิ์ที่เป็น pointer เพื่ออ้างอิงกลับไปยัง struct เดิมอีก เรียกว่าSelf-referential structure ซึ่งสามารถใช้ pointer นี้เรียกไปยังโครงสร้างอื่นหรือโครงสร้างตัวเอง เพื่อสร้างโครงสร้างข้อมูลที่เชื่อมกันเป็นสาย หรือ linked list
// การเข้าถึง list แต่ละ list เข้าถึงได้โดยใช้ลูปโดย เมื่อเข้าถึง node เดิมเสร็จ ให้เข้าไปยัง node ที่เชื่อมถัดไป วนลูปไปเรี่อยๆ จนกว่าจะไม่มี node ที่เชื่อมถัดไป
// การลบ node ออกจาก list ให้เปลี่ยนจุดหมายปลายทางของเส้นเชื่อม เช่นแต่เดิม เชื่อม ระหว่าง node A-> B-> C ให้อ้อม node ที่ต้องการลบ(B)แทน เป็น A->C โดยตรง
// การเพิ่ม node เข้าไปใน linked list สามารถทำได้โดยให้เปลี่ยนสายเชื่อมจาก node ก่อนหน้าไปยัง node ใหม่ และจาก node ใหม่ไปยัง node ที่อยู่ถัดไป 

// Doubly Linked List ใช้เรียก list ที่แต่ละ node เชื่อมกันด้วยเส้นเชื่อม 2 เส้น
// Circular Linked List ใช้เรียก list ที่สามารถ วนจากท้ายมาหัวของ list ได้
// Doubly Circular Linked List ใช้เรียก list ที่สามารถ วนจากหัวไปท้าย หรือ จากท้ายมาหัว ของ list ได้
    
    
    
 
}