
int main(){
 // int A[n] | int คือประเภทอาร์เรย์สมาชิกทุกตัวจะประเภทเดียวกันหมด Aคือชื่อ [n] คือขนาด array โดยจะมี index ตั้งแต่ 0 - n-1
 // ประกาศค่าโดยกำหนดตอนต้น เช่น A[3]={1,2,3}; หรือ กำหนด เฉพาะ index ก็ได้เช่น A[1]=2; หรือจะกำหนดแต่ค่าไม่ต้องกำหนดขนาดก็ได้ เช่น A[]={1,2,3} แต่จะไม่สามารถมากำหนดค่าทีละตำแหน่งแบบ A[]; A[1]=2; ไม่ได้
 
 // size ของ array ควรเป็นค่าคงที่โดยใช้ #define หรือ const 
        // การใช้ #define ใช้ประกาศนอก block โดย #define variablename  n หมายความว่าตัวอักษร variablename จะถูกแทนที่ด้วย ตัวเลข n
        // การใช้ const ให้ใช้เหมือนการประกาศตัวแปรปกติ เช่น const int a=5; ซึ่งถ้ามีการเขียนโปรแกรมให้เปลี่ยนค่า a จะขึ้น error ตอน compile

    
// การส่งค่าใน array ไปให้ฟังก์ชันจะเป็นการส่งแบบ pass by value แต่ถ้าส่งทั้ง array จะเป็นแบบ reference
// ชื่อของ array ระบุตำแหน่งของ array[0] เลย

// array 2 มิติ จะเป็นรูปแบบตาราง ประกาศโดย A[row][column] = { {1,2,3} , {4,5,6} } หรือ จะตั้งแบบปกติก็ได้เช่น A[][3]={ 1,2,3,4,5,6 } เมื่อครบcolumn ก็จะขึ้นแถวใหม่เองเลย
    // การส่งทั้ง array 2 มิติไปให้ฟังก์ชัน ทำเหมือน 1 มิติ แต่ให้กำหนด column ใน parameter ของฟังก์ชัน

}