
int main(){
// การประกาศ pointersประกาศได้โดย int *p;
// การใช้งานมักจะให้ตัวแปร p เก็บค่า address ที่ต้องการ แล้วใช้สัญลักษณ์ * ในการเข้าถึงค่าที่อยู่ใน address นั้น
    /* เช่น
    
    int *p,c;
    c=1;
    p=&c;
    *p=7;
    printf("%d",c);
    
    c จะกลายเป็น 7  */

// ปกติส่งค่าไปฟังก์ชัน จะเป็นแบบ value แต่ใช้ pointer ให้เป็นแบบ reference ได้โดย กำหนดพารามิเตอร์ของฟังก์ชันให้เป็น pointer และ เวลาส่งให้ส่งเป็น addressไป
// สามารถใช้ const กับ pointer โดยผลที่ให้จะเหมือนปกติ
// malloc() เป็นการจองพื้นที่ในหน่วยความจำโดยจะถูกเก็บไว้ในส่วน HEAP segment โดยจะจองเป็นหน่วย byte
// free() เป็นคืนพื้นที่ที่ถูกจอง
 
}