
int main(){
    // automatic storage duration จะมีค่าใน memory เมื่อถูกประกาศใน block พอ ทำงานใน block เสร็จก็จะไม่มีค่าอยู่ storage class ที่เป็นประเภทนี้คือ auto , register
    // static storage duration    จะมีค่าใน memory ตั้งแต่โปรแกรมทำงาน มีอยู่จนปรแกรมจบการทำงาน storage class ที่อยู่ในประเภทนี้คือ  extern , static
    // ปล. หากตัวแปร local ถูกประใช้คีย์เวิรด์ static จะสามารถเข้าถึงตัวแปรได้ในฟังก์ชันเท่านั้น แต่จะมีค่าอยู่ใน memory จนโปรแกรมจบการทำงาน
    
    
    // rand() เป็นฟังก์ชันสุ่มเลขตั้งแต่ 0 ถึง randmaxซึ่งค่าที่ได้จะเป็นการสุ่มแต่เมื่อเริ่มสุ่มใหม่จะได้เลขสุ่มที่เป็นเซตเดิม
    // srand() เป็นการกำหนด seedให้กับ  Random Number Generator ก่อนที่จะเรียกใช้ rand() อีกครั้งเพื่อที่จะให้เลขที่ออกมาไม่ซ้ำกันถึงแม้จะเริ่มสุ่มใหม่
    
    
}